In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_csv('salaries.csv')
pd_data=data.copy()
data.head()

   salary experience  gender married  age
0   43003         >5    male     yes   29
1   22172        3-5  female     yes   28
2   15192        3-5  female     yes   28
3   42511         >5    male      no   24
4   17813        3-5    male     yes   27

In [5]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   salary      500 non-null    int64
 1   experience  500 non-null    object
 2   gender      500 non-null    object
 3   married     500 non-null    object
 4   age         500 non-null    int64
dtypes: int64(2), object(3)
memory usage: 19.7+ KB
None

In [7]:
print(data.isnull().sum())

salary        0
experience    0
gender        0
married       0
age           0
dtype: int64

In [9]:
print(data.describe)

<bound method NDFrame.describe of      salary experience  gender married  age
0     43003         >5    male     yes   29
1     22172        3-5  female     yes   28
2     15192        3-5  female     yes   28
3     42511         >5    male      no   24
4     17813        3-5    male     yes   27
..      ...        ...     ...     ...  ...
495   46383         >5  female     yes   29
496   27875        3-5  female      no   26
497   34953         >5    male      no   22
498   20987        3-5  female      no   26
499   39619         >5  female      no   23

[500 rows x 5 columns]>

In [11]:
print(data['experience'].unique())

['>5' '3-5' '0-2']

In [13]:
print(data['experience'].value_counts())

experience
>5     246
3-5    187
0-2     67
Name: count, dtype: int64

In [15]:
print("Average age: ", round(data['age'].mean()))
print("Standard deviation: ", round(data['age'].std()))
print("Median age: ", round(data['age'].median()))

Average age:  26
Standard deviation:  2
Median age:  26

In [17]:
average_salary=pd_data["salary"].median()
pd_data["above_average"]=pd_data["salary"]>=average_salary
pd_data.head()

   salary experience  gender married  age  above_average
0   43003         >5    male     yes   29           True
1   22172        3-5  female     yes   28          False
2   15192        3-5  female     yes   28          False
3   42511         >5    male      no   24           True
4   17813        3-5    male     yes   27          False

In [19]:
top_jobs = data.groupby('experience')['salary'].mean().sort_values(ascending=False)
print(top_jobs)

experience
>5     39973.548780
3-5    22698.272727
0-2    12543.925373
Name: salary, dtype: float64

In [21]:
exp = {
    '0-2': 'fresh',
    '3-5': 'mid',
    '>5': 'senior'
}
pd_data['experience'] = pd_data['experience'].replace(exp)
pd_data.head()

   salary experience  gender married  age  above_average
0   43003     senior    male     yes   29           True
1   22172        mid  female     yes   28          False
2   15192        mid  female     yes   28          False
3   42511     senior    male      no   24           True
4   17813        mid    male     yes   27          False

In [23]:
fresh_min_salary=pd_data[pd_data["experience"]=="fresh"]["salary"].min()
fresh_max_salary=pd_data[pd_data["experience"]=="fresh"]["salary"].max()
fresh_ave_salary=pd_data[pd_data["experience"]=="fresh"]["salary"].mean()

print(f"Fresh level minimum salary: {fresh_min_salary}")
print(f"Fresh level maximum salary: {fresh_max_salary}")
print(f"Fresh level average salary: {fresh_ave_salary:.0f}",end="\n====\n")

mid_min_salary=pd_data[pd_data["experience"]=="mid"]["salary"].min()
mid_max_salary=pd_data[pd_data["experience"]=="mid"]["salary"].max()
mid_ave_salary=pd_data[pd_data["experience"]=="mid"]["salary"].mean()

print(f"Middle level minimum salary: {mid_min_salary}")
print(f"Middle level maximum salary: {mid_max_salary}")
print(f"Middle level average salary: {mid_ave_salary:.0f}",end="\n====\n")

senior_min_salary=pd_data[pd_data["experience"]=="senior"]["salary"].min()
senior_max_salary=pd_data[pd_data["experience"]=="senior"]["salary"].max()
senior_ave_salary=pd_data[pd_data["experience"]=="senior"]["salary"].mean()

print(f"Senior level minimum salary: {senior_min_salary}")
print(f"Senior level maximum salary: {senior_max_salary}")
print(f"Senior level average salary: {senior_ave_salary:.0f}",end="\n====\n")

Fresh level minimum salary: 10015
Fresh level maximum salary: 14979
Fresh level average salary: 12544
====
Middle level minimum salary: 15138
Middle level maximum salary: 29946
Middle level average salary: 22698
====
Senior level minimum salary: 30118
Senior level maximum salary: 49964
Senior level average salary: 39974
====